# Aprendiendo Python

Este código será usado para aprender python

## Ejemplo de listas

Aquí se mostrará como hacer listas y algunas de sus propiedades

In [6]:
mi_lista = ["manzana","naranja","pera","uva"]
print(mi_lista)

['manzana', 'naranja', 'pera', 'uva']

Para acceder a los elementos se usa `[]` indicando el elemento (el primero inicia en 0).

In [2]:
mi_lista[0]

'manzana'

Agregar un nuevo elemento

In [7]:
mi_lista.append("fresa")
mi_lista

['manzana', 'naranja', 'pera', 'uva', 'fresa']

## Diccionarios

Ahora trabajaremos con los diccionarios, que son parecidos a los datasets (pero no lo son)

In [1]:
dic = {
  "nombre": "Juan",
  "apellido": "Pérez",
  "edad": 30
}
dic

{'nombre': 'Juan', 'apellido': 'Pérez', 'edad': 30}

Los diccionarios pueden tener más de un valor

In [3]:
sexo = ["M","F","M"]
dic2 = {
  "nombre": ["Juan","María","José"],
  "apellido": ["Pérez","Martínez","Pérez"],
  "edad": [30,50,45],
  "genero":sexo
}
dic2

{'nombre': ['Juan', 'María', 'José'],
 'apellido': ['Pérez', 'Martínez', 'Pérez'],
 'edad': [30, 50, 45],
 'genero': ['M', 'F', 'M']}

Agregando una nueva clave a un diccionario existente

In [4]:
dic2["ocupacion"] = ["Contador","Gerente","Profesor"]
dic2

{'nombre': ['Juan', 'María', 'José'],
 'apellido': ['Pérez', 'Martínez', 'Pérez'],
 'edad': [30, 50, 45],
 'genero': ['M', 'F', 'M'],
 'ocupacion': ['Contador', 'Gerente', 'Profesor']}

## Ciclos

Haciendo un ciclo for

In [5]:
frutas = ["manzana","naranja","pera","uva","papaya"]
for x in frutas:
  print(x)

manzana
naranja
pera
uva
papaya

# Manejo de datos

Aprendiendo manejo de datos con python

In [1]:
import pandas as pd

nombres = ["ANGELICA","BRENDA","LILIANA","MARCO","FABIAN","MAURICIO"]
gpo = ["A","A","B","B","C","C"]
puntajes = [10,9,8,8,9,7]

dic = {"nombre":nombres,"grupo":gpo,"puntaje":puntajes}

mi_base = pd.DataFrame(dic)
print(mi_base)

     nombre grupo  puntaje
0  ANGELICA     A       10
1    BRENDA     A        9
2   LILIANA     B        8
3     MARCO     B        8
4    FABIAN     C        9
5  MAURICIO     C        7

Para saber de que tipo es el objeto `mi_base`.

In [8]:
type(mi_base)

pandas.core.frame.DataFrame

Para visualizar la base, se pueden usar los siguientes comandos

In [9]:
os.getcwd()

'c:\\Users\\Francisco\\FranciscoAriel.github.io\\docs\\python\\src'

In [1]:
import pandas as pd

datos = pd.read_csv("census.csv")
datos.describe()

,age,fnlwgt,education_num,capital_gain,capital_loss,hours
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

Primeros y últimos elementos del dataframe

In [10]:
datos.head(n=5)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

últimos 5

In [11]:
datos.tail(n=5)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours,native_country,income
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

para acceder a los elementos, se usa el método `iloc`

In [5]:
mi_base.iloc[1,]

nombre     BRENDA
grupo           A
puntaje         9
Name: 1, dtype: object

## Ordenando una base

Use el método `sort` para ordenar una base

In [8]:
datos_ord = mi_base.sort_values(by=["nombre"])
print(datos_ord)

     nombre grupo  puntaje
0  ANGELICA     A       10
1    BRENDA     A        9
4    FABIAN     C        9
2   LILIANA     B        8
3     MARCO     B        8
5  MAURICIO     C        7

## Datos agrupados

Para crear datos agrupados se usa el siguiente método:

In [10]:
mi_base_agrupada = mi_base.groupby(by=["grupo"])
mi_base_agrupada

In [11]:
mi_base_agrupada.aggregate(["mean"])

      puntaje
         mean
grupo
A         9.5
B         8.0
C         8.0

## Filtrado de datos

Use el método `where()` para filtrar los datos

In [14]:
filtrados = mi_base.where(mi_base["grupo"] == "A")
print(filtrados)

     nombre grupo  puntaje
0  ANGELICA     A     10.0
1    BRENDA     A      9.0
2       NaN   NaN      NaN
3       NaN   NaN      NaN
4       NaN   NaN      NaN
5       NaN   NaN      NaN